## Importing Libraries

In [81]:
import pandas as pd
import numpy as np

### Creating a Series by passing a list of values through pandas

In [82]:
ser = pd.Series([1, 3, 5, np.nan, 422, 913])
ser

0      1.0
1      3.0
2      5.0
3      NaN
4    422.0
5    913.0
dtype: float64

###  Using data_range function of pandas

In [83]:
Dates = pd.date_range("20130101", periods=6)
Dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

### Creating data frame with random values

In [84]:
df1 = pd.DataFrame(np.random.randn(6, 4), index=Dates, columns=list("WKDM"))
df1

                   W         K         D         M
2013-01-01  2.175521  1.463492  0.216567  0.320475
2013-01-02  1.630349 -0.678374  1.268896 -1.704547
2013-01-03 -0.377587 -1.515092 -1.420065  0.227813
2013-01-04 -0.653672 -0.902736  0.168562 -1.419173
2013-01-05  2.400915  1.607618 -0.107782 -0.067337
2013-01-06 -0.691421 -0.095054  1.167206  0.884765

### Creating DataFrame 02 Manually

In [85]:
df2 = pd.DataFrame(
    {
        "A": 1,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([9] * 4, dtype="int32"),
        "E": pd.Categorical(["Wajiha", "Khansa", "Deeba", "Maryam"]),
        "F": "Pass",
    }
)
df2

   A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass

### Type of Dataframe

In [86]:
df2.dtypes

A            int64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

### Applying more functions on dataframe 02

In [87]:
df2.A

0    1
1    1
2    1
3    1
Name: A, dtype: int64

In [88]:
df2.abs

<bound method NDFrame.abs of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [89]:
df2.align

<bound method NDFrame.align of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [90]:
df2.add

<bound method DataFrame.add of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [91]:
df2.boxplot

<bound method boxplot_frame of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [92]:
df2.clip

<bound method NDFrame.clip of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [93]:
df2.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [94]:
df2.copy

<bound method NDFrame.copy of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [95]:
df2.count

<bound method DataFrame.count of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [96]:
df2.combine

<bound method DataFrame.combine of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [97]:
df2.D

0    9
1    9
2    9
3    9
Name: D, dtype: int32

In [98]:
df2.describe

<bound method NDFrame.describe of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [99]:
df2.diff

<bound method DataFrame.diff of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

In [100]:
df2.duplicated

<bound method DataFrame.duplicated of    A          B    C  D       E     F
0  1 2013-01-02  1.0  9  Wajiha  Pass
1  1 2013-01-02  1.0  9  Khansa  Pass
2  1 2013-01-02  1.0  9   Deeba  Pass
3  1 2013-01-02  1.0  9  Maryam  Pass>

### Viewing data of dataframe 01

In [101]:
df1.head()

                   W         K         D         M
2013-01-01  2.175521  1.463492  0.216567  0.320475
2013-01-02  1.630349 -0.678374  1.268896 -1.704547
2013-01-03 -0.377587 -1.515092 -1.420065  0.227813
2013-01-04 -0.653672 -0.902736  0.168562 -1.419173
2013-01-05  2.400915  1.607618 -0.107782 -0.067337

In [102]:
df1.tail(2)

                   W         K         D         M
2013-01-05  2.400915  1.607618 -0.107782 -0.067337
2013-01-06 -0.691421 -0.095054  1.167206  0.884765

In [103]:
df1.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [104]:
df1.columns

Index(['W', 'K', 'D', 'M'], dtype='object')

### Return a NumPy representation of the underlying data without the index or column labels!

In [ ]:
df1.to_numpy()

### Transposing the data values of df1

In [ ]:
df1.T

### Sorting

In [106]:
df1.sort_index(axis=1, ascending=False)

                   W         M         K         D
2013-01-01  2.175521  0.320475  1.463492  0.216567
2013-01-02  1.630349 -1.704547 -0.678374  1.268896
2013-01-03 -0.377587  0.227813 -1.515092 -1.420065
2013-01-04 -0.653672 -1.419173 -0.902736  0.168562
2013-01-05  2.400915 -0.067337  1.607618 -0.107782
2013-01-06 -0.691421  0.884765 -0.095054  1.167206

### Specific Selection from data

In [107]:
df1["K"]

2013-01-01    1.463492
2013-01-02   -0.678374
2013-01-03   -1.515092
2013-01-04   -0.902736
2013-01-05    1.607618
2013-01-06   -0.095054
Freq: D, Name: K, dtype: float64

### Slicing of data

In [108]:
df1[0:1]

                   W         K         D         M
2013-01-01  2.175521  1.463492  0.216567  0.320475